### 📖 Terraform Plan (infra-io/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_monitor_scheduled_query_rules_alert_v2.cgn_card_func_cgn_activation_failure must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cgn_card_func_cgn_activation_failure" {
      ~ created_with_api_version               = "2023-03-15-preview" -> (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/scheduledQueryRules/[CGN | AppIO] App IO cannot activate CGN" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
        name                                   = "[CGN | AppIO] App IO cannot activate CGN"
      ~ scopes                                 = [ # forces replacement
          ~ "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01",
        ]
      - skip_query_validation                  = false -> null
        tags                                   = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      - target_resource_types                  = [] -> null
        # (12 unchanged attributes hidden)

      ~ action {
          - custom_properties = {} -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cgn_card_func_cgn_delete_failure must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cgn_card_func_cgn_delete_failure" {
      ~ created_with_api_version               = "2023-03-15-preview" -> (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/scheduledQueryRules/[CGN | AppIO] App IO cannot delete CGN" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
        name                                   = "[CGN | AppIO] App IO cannot delete CGN"
      ~ scopes                                 = [ # forces replacement
          ~ "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01",
        ]
      - skip_query_validation                  = false -> null
        tags                                   = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      - target_resource_types                  = [] -> null
        # (12 unchanged attributes hidden)

      ~ action {
          - custom_properties = {} -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cgn_card_func_eyca_activation_failure must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cgn_card_func_eyca_activation_failure" {
      ~ created_with_api_version               = "2023-03-15-preview" -> (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/scheduledQueryRules/[CGN | AppIO] App IO cannot activate EYCA" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
        name                                   = "[CGN | AppIO] App IO cannot activate EYCA"
      ~ scopes                                 = [ # forces replacement
          ~ "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01",
        ]
      - skip_query_validation                  = false -> null
        tags                                   = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      - target_resource_types                  = [] -> null
        # (12 unchanged attributes hidden)

      ~ action {
          - custom_properties = {} -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cgn_card_func_get_otp_failure must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cgn_card_func_get_otp_failure" {
      ~ created_with_api_version               = "2023-03-15-preview" -> (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/scheduledQueryRules/[CGN | AppIO] App IO cannot retrieve OTP" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
        name                                   = "[CGN | AppIO] App IO cannot retrieve OTP"
      ~ scopes                                 = [ # forces replacement
          ~ "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01",
        ]
      - skip_query_validation                  = false -> null
        tags                                   = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      - target_resource_types                  = [] -> null
        # (12 unchanged attributes hidden)

      ~ action {
          - custom_properties = {} -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cgn_search_func_count_failure must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cgn_search_func_count_failure" {
      ~ created_with_api_version               = "2023-03-15-preview" -> (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/scheduledQueryRules/[CGN | AppIO] App IO cannot count merchants" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
        name                                   = "[CGN | AppIO] App IO cannot count merchants"
      ~ scopes                                 = [ # forces replacement
          ~ "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01",
        ]
      - skip_query_validation                  = false -> null
        tags                                   = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      - target_resource_types                  = [] -> null
        # (12 unchanged attributes hidden)

      ~ action {
          - custom_properties = {} -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cgn_search_func_discount_bucket_code_failure must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cgn_search_func_discount_bucket_code_failure" {
      ~ created_with_api_version               = "2023-03-15-preview" -> (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/scheduledQueryRules/[CGN | AppIO] App IO cannot get discount bucket code" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
        name                                   = "[CGN | AppIO] App IO cannot get discount bucket code"
      ~ scopes                                 = [ # forces replacement
          ~ "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01",
        ]
      - skip_query_validation                  = false -> null
        tags                                   = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      - target_resource_types                  = [] -> null
        # (12 unchanged attributes hidden)

      ~ action {
          - custom_properties = {} -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cgn_search_func_merchant_profile_failure must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cgn_search_func_merchant_profile_failure" {
      ~ created_with_api_version               = "2023-03-15-preview" -> (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/scheduledQueryRules/[CGN | AppIO] App IO cannot get merchant profile" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
        name                                   = "[CGN | AppIO] App IO cannot get merchant profile"
      ~ scopes                                 = [ # forces replacement
          ~ "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01",
        ]
      - skip_query_validation                  = false -> null
        tags                                   = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      - target_resource_types                  = [] -> null
        # (12 unchanged attributes hidden)

      ~ action {
          - custom_properties = {} -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cgn_search_func_offline_merchants_failure must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cgn_search_func_offline_merchants_failure" {
      ~ created_with_api_version               = "2023-03-15-preview" -> (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/scheduledQueryRules/[CGN | AppIO] App IO cannot get offline merchants" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
        name                                   = "[CGN | AppIO] App IO cannot get offline merchants"
      ~ scopes                                 = [ # forces replacement
          ~ "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01",
        ]
      - skip_query_validation                  = false -> null
        tags                                   = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      - target_resource_types                  = [] -> null
        # (12 unchanged attributes hidden)

      ~ action {
          - custom_properties = {} -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cgn_search_func_online_merchants_failure must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cgn_search_func_online_merchants_failure" {
      ~ created_with_api_version               = "2023-03-15-preview" -> (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/scheduledQueryRules/[CGN | AppIO] App IO cannot get online merchants" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
        name                                   = "[CGN | AppIO] App IO cannot get online merchants"
      ~ scopes                                 = [ # forces replacement
          ~ "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01",
        ]
      - skip_query_validation                  = false -> null
        tags                                   = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      - target_resource_types                  = [] -> null
        # (12 unchanged attributes hidden)

      ~ action {
          - custom_properties = {} -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cgn_search_func_published_product_categories_failure must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cgn_search_func_published_product_categories_failure" {
      ~ created_with_api_version               = "2023-03-15-preview" -> (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/scheduledQueryRules/[CGN | AppIO] App IO cannot get published categories" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
        name                                   = "[CGN | AppIO] App IO cannot get published categories"
      ~ scopes                                 = [ # forces replacement
          ~ "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01",
        ]
      - skip_query_validation                  = false -> null
        tags                                   = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      - target_resource_types                  = [] -> null
        # (12 unchanged attributes hidden)

      ~ action {
          - custom_properties = {} -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cgn_search_func_search_failure must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cgn_search_func_search_failure" {
      ~ created_with_api_version               = "2023-03-15-preview" -> (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/scheduledQueryRules/[CGN | AppIO] App IO cannot search merchants" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
        name                                   = "[CGN | AppIO] App IO cannot search merchants"
      ~ scopes                                 = [ # forces replacement
          ~ "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGateways/io-p-itn-agw-01",
        ]
      - skip_query_validation                  = false -> null
        tags                                   = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      - target_resource_types                  = [] -> null
        # (12 unchanged attributes hidden)

      ~ action {
          - custom_properties = {} -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 11 to add, 0 to change, 11 to destroy.
```

</details>
